## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [10]:
import sqlalchemy

In [11]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [13]:
%sql mysql://root:123qwe@localhost/mydb

In [14]:
%%sql
DROP SCHEMA IF EXISTS stepik;
CREATE SCHEMA IF NOT EXISTS stepik;

 * mysql://root:***@localhost/mydb
0 rows affected.
1 rows affected.

[]

## 1.1.8 Создание таблицы

Сформулируйте SQL запрос для создания таблицы **book**, занесите  его в окно кода (расположено ниже)  и отправьте на проверку (кнопка **Отправить**). Структура таблицы **book**:

| Поле | Тип, описание |
| :- | :-|
| book_id | INT PRIMARY KEY AUTO_INCREMENT |
| title | VARCHAR(50) |
| author | VARCHAR(30) |
| price | DECIMAL(8, 2) |
| amount | INT |

In [15]:
%%sql
CREATE TABLE book(
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8, 2),
    amount INT
);

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

In [16]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

## 1.1.9 Вставка записи в таблицу

Занесите новую строку в таблицу **book** (текстовые значения (тип **VARCHAR**) заключать либо в двойные, либо в одинарные кавычки):
  
| book_id | title | author | price | amount |
| :- | :-| :-| :-| :-|
| INT PRIMARY KEY AUTO_INCREMENT | VARCHAR(50) | VARCHAR(30) | DECIMAL(8,2) | INT |
| 1 | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3 |

In [17]:
%%sql
INSERT INTO book(title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

In [18]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
1 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3)]

## 1.1.10 Задание

Занесите три последние записи в таблицу **book**, первая запись уже добавлена на предыдущем шаге:
  
| book_id | title | author | price | amount |
| :- | :-| :-| :-| :-|
| INT PRIMARY KEY AUTO_INCREMENT | VARCHAR(50) | VARCHAR(30) | DECIMAL(8,2) | INT |
| 1 | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3 |
| 2 | Белая гвардия | Булгаков М.А.| 540.50 | 5 |
| 3 | Идиот| Достоевский Ф.М. | 460.00 | 10 |
| 4 | Братья Карамазовы | Достоевский Ф.М. | 799.01 | 2 |

In [19]:
%%sql
INSERT INTO book(title, author, price, amount)
VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
       ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
       ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);

 * mysql://root:***@localhost/mydb
3 rows affected.

[]

### Для п.1.1.2 добавляем еще одну строку

In [20]:
%%sql
INSERT INTO book(title, author, price, amount)
VALUES ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

# 1.1.2 Выборка всех данных из таблицы

Вывести информацию о всех книгах, хранящихся на складе.

In [22]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

## 1.1.3 Выборка отдельных столбцов

Выбрать авторов, название книг и их цену из таблицы book.

In [23]:
%%sql
SELECT author, title, price FROM book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('650.00'))]

## 1.1.4 Выборка новых столбцов и присвоение им новых имен

In [24]:
%%sql
SELECT 
    title AS "Название",
    author AS "Автор"
FROM
    book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Идиот', 'Достоевский Ф.М.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.'),
 ('Стихотворения и поэмы', 'Есенин С.А.')]

## 1.1.5 Выборка данных с созданием вычисляемого столбца

Для упаковки каждой книги требуется один лист бумаги, цена которого 1 рубль 65 копеек. Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать все экземпляры книги). В запросе вывести название книги, ее количество и стоимость упаковки, последний столбец назвать **pack**.

In [25]:
%%sql
SELECT
    title,
    amount,
    amount * 1.65 AS pack
FROM
    book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Мастер и Маргарита', 3, Decimal('4.95')),
 ('Белая гвардия', 5, Decimal('8.25')),
 ('Идиот', 10, Decimal('16.50')),
 ('Братья Карамазовы', 2, Decimal('3.30')),
 ('Стихотворения и поэмы', 15, Decimal('24.75'))]

## 1.1.6 Выборка данных, вычисляемые столбцы, математические функции

В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.

In [26]:
%%sql
SELECT
    title,
    author,
    amount,
    ROUND(price * 0.7, 2) AS new_price
FROM
    book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', 3, Decimal('469.69')),
 ('Белая гвардия', 'Булгаков М.А.', 5, Decimal('378.35')),
 ('Идиот', 'Достоевский Ф.М.', 10, Decimal('322.00')),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 2, Decimal('559.31')),
 ('Стихотворения и поэмы', 'Есенин С.А.', 15, Decimal('455.00'))]

## 1.1.7 Выборка данных, вычисляемые столбцы, логические функции

При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова, на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%, а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и новую цену, последний столбец назвать **new_price**. Значение округлить до двух знаков после запятой.

In [27]:
%%sql
SELECT
    author,
    title,
    ROUND(
        IF(author = 'Булгаков М.А.', price * 1.1,
            IF(author = 'Есенин С.А.', price * 1.05, price)), 2) AS new_price
FROM
    book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('738.09')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('594.55')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('682.50'))]

## 1.1.8 Выборка данных по условию

Вывести автора, название  и цены тех книг, количество которых меньше 10.

In [28]:
%%sql
SELECT
    author,
    title,
    price
FROM
    book
WHERE
    amount < 10;

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01'))]

## 1.1.9 Выборка данных, логические операции

Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех экземпляров этих книг больше или равна 5000.

In [29]:
%%sql
SELECT
    title,
    author,
    price,
    amount
FROM
    book
WHERE
    (price < 500 or price > 600) AND
    price * amount > 5000;

 * mysql://root:***@localhost/mydb
1 rows affected.

[('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

## 1.2.0 Выборка данных, операторы BETWEEN, IN

Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 (включая границы),  а количество или 2, или 3, или 5, или 7 .

In [30]:
%%sql
SELECT
    title,
    author
FROM
    book
WHERE
    price BETWEEN 540.50 AND 800 AND
    amount IN (2, 3, 5, 7)

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.')]

## 1.2.1 Выборка данных с сортировкой

Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). Информацию  отсортировать сначала по авторам (в обратном алфавитном порядке), а затем по названиям книг (по алфавиту).

In [31]:
%%sql
SELECT
    author,
    title
FROM
    book
WHERE
    amount BETWEEN 2 AND 14
ORDER BY
    author DESC,
    title ASC

 * mysql://root:***@localhost/mydb
4 rows affected.

[('Достоевский Ф.М.', 'Братья Карамазовы'),
 ('Достоевский Ф.М.', 'Идиот'),
 ('Булгаков М.А.', 'Белая гвардия'),
 ('Булгаков М.А.', 'Мастер и Маргарита')]

## 1.2.2 Выборка данных, оператор LIKE

Вывести название и автора тех книг, название которых состоит из двух и более слов, а инициалы автора содержат букву «С». Считать, что в названии слова отделяются друг от друга пробелами и не содержат знаков препинания, между фамилией автора и инициалами обязателен пробел, инициалы записываются без пробела в формате: буква, точка, буква, точка. Информацию отсортировать по названию книги в алфавитном порядке.

### Дополнение
Для этого задания на курсе добавлена дополнительные строки, в текущую таблицу с решениями они не внесены, но на предлагаемое решение это не влияет, только на результат.

In [35]:
%%sql
SELECT
    title,
    author
FROM
    book
WHERE
    title LIKE "%_ _%" AND
    author LIKE "%С.%"
ORDER BY
    title

 * mysql://root:***@localhost/mydb
1 rows affected.

[('Стихотворения и поэмы', 'Есенин С.А.')]